In [1]:
# %% Imports and Configuration
import pandas as pd
from sqlalchemy import create_engine, text
from IPython.display import display, Markdown

# PostgreSQL Configuration
PG_CONFIG = {
    'host': 'localhost',
    'port': 5432,
    'dbname': 'olap',
    'user': 'postgres',
    'password': 'aa'
}

# Create SQLAlchemy engine
conn_str = f"postgresql://{PG_CONFIG['user']}:{PG_CONFIG['password']}@{PG_CONFIG['host']}:{PG_CONFIG['port']}/{PG_CONFIG['dbname']}"
engine = create_engine(conn_str)

print('‚úÖ Connected to PostgreSQL')
print(f"üóÑÔ∏è  Database: {PG_CONFIG['dbname']} @ {PG_CONFIG['host']}:{PG_CONFIG['port']}")

‚úÖ Connected to PostgreSQL
üóÑÔ∏è  Database: olap @ localhost:5432

## Task 5: Basic Aggregate Queries

Using SUM, AVG, COUNT, MIN, MAX functions.

In [2]:
# %% Task 5.1: Overall Sales Aggregates
print('=' * 80)
print('üìä TASK 5.1: Overall Sales Aggregates')
print('=' * 80)

query = """
SELECT 
    COUNT(*) AS total_transactions,
    COUNT(DISTINCT order_id) AS unique_orders,
    ROUND(SUM(sales)::numeric, 2) AS total_sales,
    ROUND(AVG(sales)::numeric, 2) AS avg_sales,
    ROUND(MIN(sales)::numeric, 2) AS min_sales,
    ROUND(MAX(sales)::numeric, 2) AS max_sales,
    SUM(quantity) AS total_quantity
FROM fact_sales;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 5.1 Complete')

================================================================================
üìä TASK 5.1: Overall Sales Aggregates
================================================================================

,total_transactions,unique_orders,total_sales,avg_sales,min_sales,max_sales,total_quantity
0,9800,4922,2261536.97,230.77,0.44,22638.48,9800

‚úÖ Task 5.1 Complete

In [3]:
# %% Task 5.2: Sales by Category
print('\n' + '=' * 80)
print('üìä TASK 5.2: Sales Aggregates by Category')
print('=' * 80)

query = """
SELECT 
    p.category,
    COUNT(*) AS transaction_count,
    COUNT(DISTINCT f.order_id) AS order_count,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
    ROUND(AVG(f.sales)::numeric, 2) AS avg_sales,
    ROUND(MIN(f.sales)::numeric, 2) AS min_sales,
    ROUND(MAX(f.sales)::numeric, 2) AS max_sales
FROM fact_sales f
LEFT JOIN dim_product p ON f.product_key = p.product_key
GROUP BY p.category
ORDER BY total_sales DESC NULLS LAST;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 5.2 Complete')

================================================================================
üìä TASK 5.2: Sales Aggregates by Category
================================================================================

,category,transaction_count,order_count,total_sales,avg_sales,min_sales,max_sales
0,Technology,1813,1519,827455.94,456.40,0.99,22638.48
1,Furniture,2078,1727,728658.75,350.65,1.89,4416.17
2,Office Supplies,5909,3676,705422.28,119.38,0.44,9892.74

‚úÖ Task 5.2 Complete

In [4]:
# %% Task 5.3: Sales by Region and Segment
print('\n' + '=' * 80)
print('üìä TASK 5.3: Sales Aggregates by Region and Segment')
print('=' * 80)

query = """
SELECT 
    g.region,
    c.segment,
    COUNT(*) AS transaction_count,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
    ROUND(AVG(f.sales)::numeric, 2) AS avg_sales
FROM fact_sales f
LEFT JOIN dim_geography g ON f.geo_key = g.geo_key
LEFT JOIN dim_customer c ON f.customer_key = c.customer_key
GROUP BY g.region, c.segment
ORDER BY g.region, total_sales DESC NULLS LAST;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 5.3 Complete')

================================================================================
üìä TASK 5.3: Sales Aggregates by Region and Segment
================================================================================

     region      segment  transaction_count  total_sales  avg_sales
0   Central     Consumer               1188    250210.52     210.61
1   Central    Corporate                661    152031.47     230.00
2   Central  Home Office                428     90404.91     211.23
3      East     Consumer               1444    347906.61     240.93
4      East    Corporate                850    195897.53     230.47
5      East  Home Office                491    125714.71     256.04
6     South     Consumer                831    194702.16     234.30
7     South    Corporate                500    120546.89     241.09
8     South  Home Office                267     73902.40     276.79
9      West     Consumer               1638    355241.22     216.87
10     West    Corporate                942    220018.25     233.57
11     West  Home Office                560    134960.30     241.00

‚úÖ Task 5.3 Complete

In [5]:
# %% Task 5.4: Sales by Year and Quarter
print('\n' + '=' * 80)
print('üìä TASK 5.4: Sales Aggregates by Year and Quarter')
print('=' * 80)

query = """
SELECT 
    t.year,
    t.quarter_name,
    COUNT(*) AS transaction_count,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
    ROUND(AVG(f.sales)::numeric, 2) AS avg_sales,
    ROUND(MAX(f.sales)::numeric, 2) AS max_sales
FROM fact_sales f
LEFT JOIN dim_time t ON f.time_key = t.time_key
GROUP BY t.year, t.quarter, t.quarter_name
ORDER BY t.year, t.quarter;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 5.4 Complete')

================================================================================
üìä TASK 5.4: Sales Aggregates by Year and Quarter
================================================================================

    year quarter_name  transaction_count  total_sales  avg_sales  max_sales
0   2015           Q1                277     73931.46     266.90   22638.48
1   2015           Q2                382     85874.10     224.80    4164.05
2   2015           Q3                555    142522.57     256.80    9449.95
3   2015           Q4                739    177528.14     240.23    6999.96
4   2016           Q1                249     62357.68     250.43    6354.95
5   2016           Q2                431     87713.46     203.51    3812.97
6   2016           Q3                579    128560.14     222.04    4228.70
7   2016           Q4                796    180804.66     227.14    4899.93
8   2017           Q1                333     92686.38     278.34    8749.95
9   2017           Q2                585    135061.19     230.87    9099.93
10  2017           Q3                720    138056.43     191.75    4355.17
11  2017           Q4                896    234388.80     261.59   17499.95
12  2018           Q1                484    122260.86     252.61   13999.96
13  2018           Q2                675    127558.58     188.98    4799.98
14  2018           Q3                890    193815.83     217.77    4663.74
15  2018           Q4               1209    278416.69     230.29   11199.97

‚úÖ Task 5.4 Complete

## Task 6: GROUP BY ROLLUP Query

ROLLUP creates subtotals for hierarchical groups.

In [6]:
# %% Task 6: ROLLUP - Sales by Category and Sub-Category with Subtotals
print('=' * 80)
print('üìä TASK 6: GROUP BY ROLLUP - Category and Sub-Category Sales')
print('=' * 80)

query = """
SELECT 
    COALESCE(p.category, 'GRAND TOTAL') AS category,
    COALESCE(p.sub_category, 'Category Subtotal') AS sub_category,
    COUNT(*) AS transaction_count,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
    ROUND(AVG(f.sales)::numeric, 2) AS avg_sales
FROM fact_sales f
LEFT JOIN dim_product p ON f.product_key = p.product_key
GROUP BY ROLLUP(p.category, p.sub_category)
ORDER BY 
    CASE WHEN p.category IS NULL THEN 1 ELSE 0 END,
    p.category,
    CASE WHEN p.sub_category IS NULL THEN 1 ELSE 0 END,
    p.sub_category;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° Explanation: ROLLUP creates subtotals for each category and a grand total.')
print('‚úÖ Task 6 Complete')

================================================================================
üìä TASK 6: GROUP BY ROLLUP - Category and Sub-Category Sales
================================================================================

,category,sub_category,transaction_count,total_sales,avg_sales
0,Furniture,Bookcases,226,113813.25,503.60
1,Furniture,Chairs,607,322822.75,531.83
2,Furniture,Furnishings,931,89211.98,95.82
3,Furniture,Tables,314,202810.77,645.89
4,Furniture,Category Subtotal,2078,728658.75,350.65
5,Office Supplies,Appliances,459,104618.38,227.93
6,Office Supplies,Art,785,26705.42,34.02
7,Office Supplies,Binders,1492,200028.82,134.07
8,Office Supplies,Envelopes,248,16128.02,65.03
9,Office Supplies,Fasteners,214,3001.93,14.03
10,Office Supplies,Labels,357,12347.71,34.59
11,Office Supplies,Paper,1338,76828.34,57.42
12,Office Supplies,Storage,832,219343.37,263.63
13,Office Supplies,Supplies,184,46420.29,252.28
14,Office Supplies,Category Subtotal,5909,705422.28,119.38
15,Technology,Accessories,756,164186.70,217.18
16,Technology,Copiers,66,146248.07,2215.88
17,Technology,Machines,115,189238.68,1645.55
18,Technology,Phones,876,327782.49,374.18
19,Technology,Category Subtotal,1813,827455.94,456.40
20,GRAND TOTAL,Category Subtotal,9800,2261536.97,230.77

üí° Explanation: ROLLUP creates subtotals for each category and a grand total.
‚úÖ Task 6 Complete

In [7]:
# %% Task 6 (Bonus): ROLLUP - Sales by Year, Quarter, Month
print('\n' + '=' * 80)
print('üìä TASK 6 (Bonus): GROUP BY ROLLUP - Year, Quarter, Month Hierarchy')
print('=' * 80)

query = """
SELECT 
    COALESCE(t.year::text, 'GRAND TOTAL') AS year,
    COALESCE(t.quarter_name, 'Year Subtotal') AS quarter,
    COALESCE(t.month_name, 'Quarter Subtotal') AS month,
    COUNT(*) AS transactions,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales
FROM fact_sales f
LEFT JOIN dim_time t ON f.time_key = t.time_key
GROUP BY ROLLUP(t.year, t.quarter_name, t.month_name)
ORDER BY 
    CASE WHEN t.year IS NULL THEN 1 ELSE 0 END,
    t.year,
    CASE WHEN t.quarter_name IS NULL THEN 1 ELSE 0 END,
    t.quarter_name,
    CASE WHEN t.month_name IS NULL THEN 1 ELSE 0 END,
    t.month_name
LIMIT 50;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 6 Bonus Complete')

================================================================================
üìä TASK 6 (Bonus): GROUP BY ROLLUP - Year, Quarter, Month Hierarchy
================================================================================

    year        quarter             month  transactions  total_sales
0   2015             Q1          February            46      4519.92
1   2015             Q1           January            77     14205.71
2   2015             Q1             March           154     55205.83
3   2015             Q1  Quarter Subtotal           277     73931.46
4   2015             Q2             April           130     27906.86
5   2015             Q2              June           131     34322.94
6   2015             Q2               May           121     23644.30
7   2015             Q2  Quarter Subtotal           382     85874.10
8   2015             Q3            August           146     27117.53
9   2015             Q3              July           142     33781.52
10  2015             Q3         September           267     81623.52
11  2015             Q3  Quarter Subtotal           555    142522.57
12  2015             Q4          December           274     68167.08
13  2015             Q4          November           306     77907.69
14  2015             Q4           October           159     31453.37
15  2015             Q4  Quarter Subtotal           739    177528.14
16  2015  Year Subtotal  Quarter Subtotal          1953    479856.27
17  2016             Q1          February            64     11951.40
18  2016             Q1           January            57     18066.96
19  2016             Q1             March           128     32339.32
20  2016             Q1  Quarter Subtotal           249     62357.68
21  2016             Q2             April           159     34154.51
22  2016             Q2              June           129     23599.39
23  2016             Q2               May           143     29959.56
24  2016             Q2  Quarter Subtotal           431     87713.46
25  2016             Q3            August           158     36818.33
26  2016             Q3              July           136     28608.25
27  2016             Q3         September           285     63133.56
28  2016             Q3  Quarter Subtotal           579    128560.14
29  2016             Q4          December           311     74543.60
30  2016             Q4          November           321     75249.35
31  2016             Q4           October           164     31011.71
32  2016             Q4  Quarter Subtotal           796    180804.66
33  2016  Year Subtotal  Quarter Subtotal          2055    459435.94
34  2017             Q1          February            83     22978.82
35  2017             Q1           January            89     18542.52
36  2017             Q1             March           161     51165.04
37  2017             Q1  Quarter Subtotal           333     92686.38
38  2017             Q2             April           168     38679.77
39  2017             Q2              June           196     39724.49
40  2017             Q2               May           221     56656.93
41  2017             Q2  Quarter Subtotal           585    135061.19
42  2017             Q3            August           175     30542.18
43  2017             Q3              July           196     38320.81
44  2017             Q3         September           349     69193.44
45  2017             Q3  Quarter Subtotal           720    138056.43
46  2017             Q4          December           338     95739.15
47  2017             Q4          November           366     79066.56
48  2017             Q4           October           192     59583.09
49  2017             Q4  Quarter Subtotal           896    234388.80

‚úÖ Task 6 Bonus Complete

## Task 7: GROUP BY CUBE Query

CUBE creates subtotals for all possible combinations of dimensions.

In [8]:
# %% Task 7: CUBE - Sales by Region and Segment
print('=' * 80)
print('üìä TASK 7: GROUP BY CUBE - Region and Segment Sales')
print('=' * 80)

query = """
SELECT 
    COALESCE(g.region, 'ALL REGIONS') AS region,
    COALESCE(c.segment, 'ALL SEGMENTS') AS segment,
    COUNT(*) AS transaction_count,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
    ROUND(AVG(f.sales)::numeric, 2) AS avg_sales
FROM fact_sales f
LEFT JOIN dim_geography g ON f.geo_key = g.geo_key
LEFT JOIN dim_customer c ON f.customer_key = c.customer_key
GROUP BY CUBE(g.region, c.segment)
ORDER BY 
    CASE WHEN g.region IS NULL THEN 1 ELSE 0 END,
    g.region,
    CASE WHEN c.segment IS NULL THEN 1 ELSE 0 END,
    c.segment;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° Explanation: CUBE creates aggregates for:')
print('   - Each region + segment combination')
print('   - Each region (all segments)')
print('   - Each segment (all regions)')
print('   - Grand total (all regions and segments)')
print('‚úÖ Task 7 Complete')

================================================================================
üìä TASK 7: GROUP BY CUBE - Region and Segment Sales
================================================================================

         region       segment  transaction_count  total_sales  avg_sales
0       Central      Consumer               1188    250210.52     210.61
1       Central     Corporate                661    152031.47     230.00
2       Central   Home Office                428     90404.91     211.23
3       Central  ALL SEGMENTS               2277    492646.90     216.36
4          East      Consumer               1444    347906.61     240.93
5          East     Corporate                850    195897.53     230.47
6          East   Home Office                491    125714.71     256.04
7          East  ALL SEGMENTS               2785    669518.85     240.40
8         South      Consumer                831    194702.16     234.30
9         South     Corporate                500    120546.89     241.09
10        South   Home Office                267     73902.40     276.79
11        South  ALL SEGMENTS               1598    389151.45     243.52
12         West      Consumer               1638    355241.22     216.87
13         West     Corporate                942    220018.25     233.57
14         West   Home Office                560    134960.30     241.00
15         West  ALL SEGMENTS               3140    710219.77     226.18
16  ALL REGIONS      Consumer               5101   1148060.51     225.07
17  ALL REGIONS     Corporate               2953    688494.14     233.15
18  ALL REGIONS   Home Office               1746    424982.32     243.40
19  ALL REGIONS  ALL SEGMENTS               9800   2261536.97     230.77

üí° Explanation: CUBE creates aggregates for:
   - Each region + segment combination
   - Each region (all segments)
   - Each segment (all regions)
   - Grand total (all regions and segments)
‚úÖ Task 7 Complete

In [9]:
# %% Task 7 (Bonus): CUBE - Sales by Category and Year
print('\n' + '=' * 80)
print('üìä TASK 7 (Bonus): GROUP BY CUBE - Category and Year')
print('=' * 80)

query = """
SELECT 
    COALESCE(p.category, 'ALL CATEGORIES') AS category,
    COALESCE(t.year::text, 'ALL YEARS') AS year,
    COUNT(*) AS transactions,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales
FROM fact_sales f
LEFT JOIN dim_product p ON f.product_key = p.product_key
LEFT JOIN dim_time t ON f.time_key = t.time_key
GROUP BY CUBE(p.category, t.year)
ORDER BY 
    CASE WHEN p.category IS NULL THEN 1 ELSE 0 END,
    p.category,
    CASE WHEN t.year IS NULL THEN 1 ELSE 0 END,
    t.year;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 7 Bonus Complete')

================================================================================
üìä TASK 7 (Bonus): GROUP BY CUBE - Category and Year
================================================================================

           category       year  transactions  total_sales
0         Furniture       2015           414    156477.92
1         Furniture       2016           440    164053.88
2         Furniture       2017           547    195813.15
3         Furniture       2018           677    212313.80
4         Furniture  ALL YEARS          2078    728658.75
5   Office Supplies       2015          1192    149512.81
6   Office Supplies       2016          1210    133124.36
7   Office Supplies       2017          1537    182417.65
8   Office Supplies       2018          1970    240367.46
9   Office Supplies  ALL YEARS          5909    705422.28
10       Technology       2015           347    173865.54
11       Technology       2016           405    162257.70
12       Technology       2017           450    221962.00
13       Technology       2018           611    269370.70
14       Technology  ALL YEARS          1813    827455.94
15   ALL CATEGORIES       2015          1953    479856.27
16   ALL CATEGORIES       2016          2055    459435.94
17   ALL CATEGORIES       2017          2534    600192.80
18   ALL CATEGORIES       2018          3258    722051.96
19   ALL CATEGORIES  ALL YEARS          9800   2261536.97

‚úÖ Task 7 Bonus Complete

## Task 8: GROUPING SETS Query

GROUPING SETS allows you to specify exactly which groupings you want.

In [10]:
# %% Task 8: GROUPING SETS - Custom Aggregations
print('=' * 80)
print('üìä TASK 8: GROUPING SETS - Custom Sales Aggregations')
print('=' * 80)

query = """
SELECT 
    COALESCE(p.category, 'N/A') AS category,
    COALESCE(g.region, 'N/A') AS region,
    COALESCE(t.year::text, 'N/A') AS year,
    COUNT(*) AS transaction_count,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
    CASE 
        WHEN p.category IS NOT NULL AND g.region IS NOT NULL AND t.year IS NOT NULL THEN 'Category + Region + Year'
        WHEN p.category IS NOT NULL AND g.region IS NOT NULL THEN 'Category + Region'
        WHEN p.category IS NOT NULL AND t.year IS NOT NULL THEN 'Category + Year'
        WHEN g.region IS NOT NULL AND t.year IS NOT NULL THEN 'Region + Year'
        ELSE 'Grand Total'
    END AS grouping_level
FROM fact_sales f
LEFT JOIN dim_product p ON f.product_key = p.product_key
LEFT JOIN dim_geography g ON f.geo_key = g.geo_key
LEFT JOIN dim_time t ON f.time_key = t.time_key
GROUP BY GROUPING SETS (
    (p.category, g.region, t.year),  -- Three dimensions
    (p.category, g.region),          -- Category and Region
    (p.category, t.year),            -- Category and Year
    (g.region, t.year),              -- Region and Year
    ()                               -- Grand Total
)
ORDER BY 
    grouping_level,
    p.category,
    g.region,
    t.year
LIMIT 50;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° Explanation: GROUPING SETS allows custom grouping combinations.')
print('‚úÖ Task 8 Complete')

================================================================================
üìä TASK 8: GROUPING SETS - Custom Sales Aggregations
================================================================================

,category,region,year,transaction_count,total_sales,grouping_level
0,Furniture,Central,N/A,470,160317.56,Category + Region
1,Furniture,East,N/A,591,206461.36,Category + Region
2,Furniture,South,N/A,326,116531.47,Category + Region
3,Furniture,West,N/A,691,245348.36,Category + Region
4,Office Supplies,Central,N/A,1399,163590.15,Category + Region
5,Office Supplies,East,N/A,1667,199940.90,Category + Region
6,Office Supplies,South,N/A,983,124424.77,Category + Region
7,Office Supplies,West,N/A,1860,217466.46,Category + Region
8,Technology,Central,N/A,408,168739.19,Category + Region
9,Technology,East,N/A,527,263116.59,Category + Region
10,Technology,South,N/A,289,148195.21,Category + Region
11,Technology,West,N/A,589,247404.95,Category + Region
12,Furniture,Central,2015,91,32814.40,Category + Region + Year
13,Furniture,Central,2016,101,35208.61,Category + Region + Year
14,Furniture,Central,2017,132,49731.99,Category + Region + Year
15,Furniture,Central,2018,146,42562.56,Category + Region + Year
16,Furniture,East,2015,115,46833.45,Category + Region + Year
17,Furniture,East,2016,125,53810.00,Category + Region + Year
18,Furniture,East,2017,154,44964.08,Category + Region + Year
19,Furniture,East,2018,197,60853.83,Category + Region + Year
20,Furniture,South,2015,64,26942.76,Category + Region + Year
21,Furniture,South,2016,71,23844.64,Category + Region + Year
22,Furniture,South,2017,84,27875.87,Category + Region + Year
23,Furniture,South,2018,107,37868.20,Category + Region + Year
24,Furniture,West,2015,144,49887.31,Category + Region + Year
25,Furniture,West,2016,143,51190.63,Category + Region + Year
26,Furniture,West,2017,177,73241.21,Category + Region + Year
27,Furniture,West,2018,227,71029.21,Category + Region + Year
28,Office Supplies,Central,2015,294,36781.10,Category + Region + Year
29,Office Supplies,Central,2016,270,25395.79,Category + Region + Year
30,Office Supplies,Central,2017,346,45598.28,Category + Region + Year
31,Office Supplies,Central,2018,489,55814.98,Category + Region + Year
32,Office Supplies,East,2015,307,35656.68,Category + Region + Year
33,Office Supplies,East,2016,369,40078.86,Category + Region + Year
34,Office Supplies,East,2017,464,61050.10,Category + Region + Year
35,Office Supplies,East,2018,527,63155.26,Category + Region + Year
36,Office Supplies,South,2015,213,25785.82,Category + Region + Year
37,Office Supplies,South,2016,205,30228.57,Category + Region + Year
38,Office Supplies,South,2017,253,28637.89,Category + Region + Year
39,Office Supplies,South,2018,312,39772.49,Category + Region + Year
40,Office Supplies,West,2015,378,51289.21,Category + Region + Year
41,Office Supplies,West,2016,366,37421.14,Category + Region + Year
42,Office Supplies,West,2017,474,47131.38,Category + Region + Year
43,Office Supplies,West,2018,642,81624.73,Category + Region + Year
44,Technology,Central,2015,70,33325.02,Category + Region + Year
45,Technology,Central,2016,103,41820.79,Category + Region + Year
46,Technology,Central,2017,113,50343.65,Category + Region + Year
47,Technology,Central,2018,122,43249.73,Category + Region + Year
48,Technology,East,2015,84,45162.69,Category + Region + Year
49,Technology,East,2016,132,59336.26,Category + Region + Year

üí° Explanation: GROUPING SETS allows custom grouping combinations.
‚úÖ Task 8 Complete

## Task 9: RANK and DENSE_RANK Queries

Ranking functions assign ranks to rows based on ordering.

In [11]:
# %% Task 9.1: RANK - Top Products by Sales
print('=' * 80)
print('üìä TASK 9.1: RANK - Top 20 Products by Sales')
print('=' * 80)

query = """
SELECT 
    p.product_name,
    p.category,
    p.sub_category,
    ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
    COUNT(*) AS transactions,
    RANK() OVER (ORDER BY SUM(f.sales) DESC) AS sales_rank,
    DENSE_RANK() OVER (ORDER BY SUM(f.sales) DESC) AS dense_sales_rank
FROM fact_sales f
LEFT JOIN dim_product p ON f.product_key = p.product_key
GROUP BY p.product_name, p.category, p.sub_category
ORDER BY sales_rank
LIMIT 20;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° RANK skips numbers after ties, DENSE_RANK does not.')
print('‚úÖ Task 9.1 Complete')

================================================================================
üìä TASK 9.1: RANK - Top 20 Products by Sales
================================================================================

,product_name,category,sub_category,total_sales,transactions,sales_rank,dense_sales_rank
0,Canon imageCLASS 2200 Advanced Copier,Technology,Copiers,61599.83,5,1,1
1,Fellowes PB500 Electric Punch Plastic Comb Bin...,Office Supplies,Binders,27453.38,10,2,2
2,Cisco TelePresence System EX90 Videoconferenci...,Technology,Machines,22638.48,1,3,3
3,HON 5400 Series Task Chairs for Big and Tall,Furniture,Chairs,21870.57,8,4,4
4,GBC DocuBind TL300 Electric Binding System,Office Supplies,Binders,19823.48,11,5,5
5,GBC Ibimaster 500 Manual ProClick Binding System,Office Supplies,Binders,19024.50,9,6,6
6,Hewlett Packard LaserJet 3310 Copier,Technology,Copiers,18839.68,8,7,7
7,HP Designjet T520 Inkjet Large Format Printer ...,Technology,Machines,18374.90,3,8,8
8,GBC DocuBind P400 Electric Binding System,Office Supplies,Binders,17965.07,6,9,9
9,High Speed Automatic Electric Letter Opener,Office Supplies,Supplies,17030.31,3,10,10
10,Lexmark MX611dhe Monochrome Laser Printer,Technology,Machines,16829.90,4,11,11
11,Martin Yale Chadless Opener Electric Letter Op...,Office Supplies,Supplies,16656.21,6,12,12
12,Ibico EPK-21 Electric Binding System,Office Supplies,Binders,15875.92,3,13,13
13,"Riverside Palais Royal Lawyers Bookcase, Royal...",Furniture,Bookcases,15610.97,5,14,14
14,"3D Systems Cube Printer, 2nd Generation, Magenta",Technology,Machines,14299.89,2,15,15
15,Samsung Galaxy Mega 6.3,Technology,Phones,13943.67,6,16,16
16,Logitech G19 Programmable Gaming Keyboard,Technology,Accessories,13756.54,15,17,17
17,Apple iPhone 5,Technology,Phones,12996.60,6,18,18
18,Bretford Rectangular Conference Table Tops,Furniture,Tables,12995.28,12,19,19
19,Global Troy Executive Leather Low-Back Tilter,Furniture,Chairs,12975.39,9,20,20

üí° RANK skips numbers after ties, DENSE_RANK does not.
‚úÖ Task 9.1 Complete

In [12]:
# %% Task 9.2: RANK - Top Customers by Region
print('\n' + '=' * 80)
print('üìä TASK 9.2: RANK - Top 3 Customers per Region')
print('=' * 80)

query = """
WITH customer_sales AS (
    SELECT 
        g.region,
        c.customer_name,
        c.segment,
        ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
        COUNT(*) AS transactions,
        RANK() OVER (PARTITION BY g.region ORDER BY SUM(f.sales) DESC) AS rank_in_region
    FROM fact_sales f
    LEFT JOIN dim_customer c ON f.customer_key = c.customer_key
    LEFT JOIN dim_geography g ON f.geo_key = g.geo_key
    GROUP BY g.region, c.customer_name, c.segment
)
SELECT 
    region,
    customer_name,
    segment,
    total_sales,
    transactions,
    rank_in_region
FROM customer_sales
WHERE rank_in_region <= 3
ORDER BY region, rank_in_region;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° PARTITION BY creates separate rankings for each region.')
print('‚úÖ Task 9.2 Complete')

================================================================================
üìä TASK 9.2: RANK - Top 3 Customers per Region
================================================================================

,region,customer_name,segment,total_sales,transactions,rank_in_region
0,Central,Tamara Chand,Corporate,18437.14,7,1
1,Central,Adrian Barton,Consumer,12181.60,11,2
2,Central,Becky Martin,Consumer,10539.90,7,3
3,East,Tom Ashbrook,Home Office,13723.50,5,1
4,East,Hunter Lopez,Consumer,10522.55,2,2
5,East,Bill Shonely,Corporate,10022.29,4,3
6,South,Sean Miller,Home Office,23669.21,8,1
7,South,Sanjit Engle,Consumer,8805.04,3,2
8,South,Grant Thornton,Corporate,8167.42,2,3
9,West,Raymond Buch,Consumer,14345.28,6,1
10,West,Ken Lonsdale,Consumer,8472.39,7,2
11,West,Edward Hooks,Corporate,7408.09,14,3

üí° PARTITION BY creates separate rankings for each region.
‚úÖ Task 9.2 Complete

In [13]:
# %% Task 9.3: RANK - Top States by Sales with Category Breakdown
print('\n' + '=' * 80)
print('üìä TASK 9.3: RANK - Top 5 States per Category')
print('=' * 80)

query = """
WITH state_category_sales AS (
    SELECT 
        p.category,
        g.state,
        g.region,
        ROUND(SUM(f.sales)::numeric, 2) AS total_sales,
        COUNT(*) AS transactions,
        DENSE_RANK() OVER (PARTITION BY p.category ORDER BY SUM(f.sales) DESC) AS state_rank
    FROM fact_sales f
    LEFT JOIN dim_product p ON f.product_key = p.product_key
    LEFT JOIN dim_geography g ON f.geo_key = g.geo_key
    GROUP BY p.category, g.state, g.region
)
SELECT 
    category,
    state,
    region,
    total_sales,
    transactions,
    state_rank
FROM state_category_sales
WHERE state_rank <= 5
ORDER BY category, state_rank;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 9.3 Complete')

================================================================================
üìä TASK 9.3: RANK - Top 5 States per Category
================================================================================

,category,state,region,total_sales,transactions,state_rank
0,Furniture,California,West,152216.59,430,1
1,Furniture,New York,East,92504.53,231,2
2,Furniture,Texas,Central,59633.69,197,3
3,Furniture,Washington,West,44626.48,113,4
4,Furniture,Pennsylvania,East,39354.94,125,5
5,Office Supplies,California,West,139405.69,1167,1
6,Office Supplies,New York,East,86953.87,662,2
7,Office Supplies,Texas,Central,44282.52,599,3
8,Office Supplies,Washington,West,40043.68,291,4
9,Office Supplies,Michigan,Central,37688.20,158,5
10,Technology,California,West,154684.21,349,1
11,Technology,New York,East,126902.67,204,2
12,Technology,Texas,Central,64656.26,177,3
13,Technology,Washington,West,50536.71,100,4
14,Technology,Florida,South,46968.04,69,5

‚úÖ Task 9.3 Complete

## Task 10: PIVOT Query

Pivot tables transform rows into columns.

In [14]:
# %% Task 10.1: PIVOT - Sales by Category and Year
print('=' * 80)
print('üìä TASK 10.1: PIVOT - Sales by Category across Years')
print('=' * 80)

query = """
SELECT 
    category,
    ROUND(SUM(CASE WHEN year = 2014 THEN sales ELSE 0 END)::numeric, 2) AS "2014",
    ROUND(SUM(CASE WHEN year = 2015 THEN sales ELSE 0 END)::numeric, 2) AS "2015",
    ROUND(SUM(CASE WHEN year = 2016 THEN sales ELSE 0 END)::numeric, 2) AS "2016",
    ROUND(SUM(CASE WHEN year = 2017 THEN sales ELSE 0 END)::numeric, 2) AS "2017",
    ROUND(SUM(sales)::numeric, 2) AS total
FROM (
    SELECT 
        p.category,
        t.year,
        f.sales
    FROM fact_sales f
    LEFT JOIN dim_product p ON f.product_key = p.product_key
    LEFT JOIN dim_time t ON f.time_key = t.time_key
) AS sales_data
GROUP BY category
ORDER BY total DESC NULLS LAST;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° PostgreSQL uses CASE WHEN for pivoting.')
print('‚úÖ Task 10.1 Complete')

================================================================================
üìä TASK 10.1: PIVOT - Sales by Category across Years
================================================================================

          category  2014       2015       2016       2017      total
0       Technology   0.0  173865.54  162257.70  221962.00  827455.94
1        Furniture   0.0  156477.92  164053.88  195813.15  728658.75
2  Office Supplies   0.0  149512.81  133124.36  182417.65  705422.28

üí° PostgreSQL uses CASE WHEN for pivoting.
‚úÖ Task 10.1 Complete

In [15]:
# %% Task 10.2: PIVOT - Sales by Region and Segment
print('\n' + '=' * 80)
print('üìä TASK 10.2: PIVOT - Sales by Region across Segments')
print('=' * 80)

query = """
SELECT 
    region,
    ROUND(SUM(CASE WHEN segment = 'Consumer' THEN sales ELSE 0 END)::numeric, 2) AS "Consumer",
    ROUND(SUM(CASE WHEN segment = 'Corporate' THEN sales ELSE 0 END)::numeric, 2) AS "Corporate",
    ROUND(SUM(CASE WHEN segment = 'Home Office' THEN sales ELSE 0 END)::numeric, 2) AS "Home Office",
    ROUND(SUM(sales)::numeric, 2) AS total
FROM (
    SELECT 
        g.region,
        c.segment,
        f.sales
    FROM fact_sales f
    LEFT JOIN dim_geography g ON f.geo_key = g.geo_key
    LEFT JOIN dim_customer c ON f.customer_key = c.customer_key
) AS sales_data
GROUP BY region
ORDER BY total DESC NULLS LAST;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 10.2 Complete')

================================================================================
üìä TASK 10.2: PIVOT - Sales by Region across Segments
================================================================================

    region   Consumer  Corporate  Home Office      total
0     West  355241.22  220018.25    134960.30  710219.77
1     East  347906.61  195897.53    125714.71  669518.85
2  Central  250210.52  152031.47     90404.91  492646.90
3    South  194702.16  120546.89     73902.40  389151.45

‚úÖ Task 10.2 Complete

In [16]:
# %% Task 10.3: PIVOT - Quarterly Sales by Category
print('\n' + '=' * 80)
print('üìä TASK 10.3: PIVOT - Quarterly Sales by Category')
print('=' * 80)

query = """
SELECT 
    category,
    ROUND(SUM(CASE WHEN quarter_name = 'Q1' THEN sales ELSE 0 END)::numeric, 2) AS "Q1",
    ROUND(SUM(CASE WHEN quarter_name = 'Q2' THEN sales ELSE 0 END)::numeric, 2) AS "Q2",
    ROUND(SUM(CASE WHEN quarter_name = 'Q3' THEN sales ELSE 0 END)::numeric, 2) AS "Q3",
    ROUND(SUM(CASE WHEN quarter_name = 'Q4' THEN sales ELSE 0 END)::numeric, 2) AS "Q4",
    ROUND(SUM(sales)::numeric, 2) AS total
FROM (
    SELECT 
        p.category,
        t.quarter_name,
        f.sales
    FROM fact_sales f
    LEFT JOIN dim_product p ON f.product_key = p.product_key
    LEFT JOIN dim_time t ON f.time_key = t.time_key
) AS sales_data
GROUP BY category
ORDER BY total DESC NULLS LAST;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 10.3 Complete')

================================================================================
üìä TASK 10.3: PIVOT - Quarterly Sales by Category
================================================================================

          category         Q1         Q2         Q3         Q4      total
0       Technology  150360.15  158916.56  200658.67  317520.56  827455.94
1        Furniture   93316.22  139004.96  196700.79  299636.78  728658.75
2  Office Supplies  107560.01  138285.81  205595.51  253980.95  705422.28

‚úÖ Task 10.3 Complete

## Task 11: Window Functions

Window functions for moving averages and cumulative sums.

In [17]:
# %% Task 11.1: Cumulative Sales by Date
print('=' * 80)
print('üìä TASK 11.1: Cumulative Sales Over Time')
print('=' * 80)

query = """
SELECT 
    t.date_full,
    COUNT(*) AS daily_transactions,
    ROUND(SUM(f.sales)::numeric, 2) AS daily_sales,
    ROUND(SUM(SUM(f.sales)) OVER (ORDER BY t.date_full ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW)::numeric, 2) AS cumulative_sales,
    ROUND(AVG(SUM(f.sales)) OVER (ORDER BY t.date_full ROWS BETWEEN 6 PRECEDING AND CURRENT ROW)::numeric, 2) AS moving_avg_7_days
FROM fact_sales f
LEFT JOIN dim_time t ON f.time_key = t.time_key
GROUP BY t.date_full
ORDER BY t.date_full
LIMIT 50;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° Cumulative sales sum all previous days.')
print('üí° Moving average uses last 7 days (including current).')
print('‚úÖ Task 11.1 Complete')

================================================================================
üìä TASK 11.1: Cumulative Sales Over Time
================================================================================

,date_full,daily_transactions,daily_sales,cumulative_sales,moving_avg_7_days
0,2015-01-03,1,16.45,16.45,16.45
1,2015-01-04,3,288.06,304.51,152.26
2,2015-01-05,1,19.54,324.05,108.02
3,2015-01-06,9,4407.10,4731.15,1182.79
4,2015-01-07,2,87.16,4818.31,963.66
5,2015-01-09,2,40.54,4858.85,809.81
6,2015-01-10,2,54.83,4913.68,701.95
7,2015-01-11,1,9.94,4923.62,701.02
8,2015-01-13,11,3553.80,8477.42,1167.56
9,2015-01-14,1,61.96,8539.38,1173.62
10,2015-01-15,1,149.95,8689.33,565.45
11,2015-01-16,4,299.96,8989.29,595.85
12,2015-01-18,1,64.86,9054.15,599.33
13,2015-01-19,4,378.59,9432.74,645.58
14,2015-01-20,17,2673.87,12106.61,1026.14
15,2015-01-23,1,40.08,12146.69,524.18
16,2015-01-26,9,1097.25,13243.94,672.08
17,2015-01-27,3,426.67,13670.61,711.61
18,2015-01-28,1,3.93,13674.54,669.32
19,2015-01-30,2,240.50,13915.04,694.41
20,2015-01-31,1,290.67,14205.71,681.85
21,2015-02-01,1,468.90,14674.61,366.86
22,2015-02-02,3,211.65,14886.26,391.37
23,2015-02-03,2,97.11,14983.37,248.49
24,2015-02-04,3,134.39,15117.76,206.74
25,2015-02-06,4,330.51,15448.27,253.39
26,2015-02-07,2,180.32,15628.59,244.79
27,2015-02-08,1,14.56,15643.15,205.35
28,2015-02-11,9,2043.40,17686.55,430.28
29,2015-02-12,1,129.57,17816.12,418.55
30,2015-02-14,4,576.73,18392.85,487.07
31,2015-02-15,1,21.36,18414.21,470.92
32,2015-02-16,2,9.04,18423.25,425.00
33,2015-02-17,1,54.21,18477.46,406.98
34,2015-02-18,2,37.78,18515.24,410.30
35,2015-02-20,3,95.59,18610.83,132.04
36,2015-02-21,1,8.85,18619.68,114.79
37,2015-02-22,1,19.44,18639.12,35.18
38,2015-02-23,2,11.37,18650.49,33.75
39,2015-02-24,2,55.68,18706.17,40.42
40,2015-02-27,1,19.46,18725.63,35.45
41,2015-03-01,10,2203.15,20928.78,344.79
42,2015-03-02,2,47.76,20976.54,337.96
43,2015-03-03,9,1345.89,22322.43,528.96
44,2015-03-04,2,370.45,22692.88,579.11
45,2015-03-05,5,705.56,23398.44,678.28
46,2015-03-07,8,1561.06,24959.50,893.33
47,2015-03-10,3,741.96,25701.46,996.55
48,2015-03-11,8,918.31,26619.77,813.00
49,2015-03-14,11,2108.56,28728.33,1107.40

üí° Cumulative sales sum all previous days.
üí° Moving average uses last 7 days (including current).
‚úÖ Task 11.1 Complete

In [18]:
# %% Task 11.2: Monthly Sales with Moving Average
print('\n' + '=' * 80)
print('üìä TASK 11.2: Monthly Sales with 3-Month Moving Average')
print('=' * 80)

query = """
SELECT 
    t.year,
    t.month,
    t.month_name,
    COUNT(*) AS transactions,
    ROUND(SUM(f.sales)::numeric, 2) AS monthly_sales,
    ROUND(AVG(SUM(f.sales)) OVER (
        ORDER BY t.year, t.month 
        ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
    )::numeric, 2) AS moving_avg_3_months,
    ROUND(SUM(SUM(f.sales)) OVER (
        ORDER BY t.year, t.month 
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    )::numeric, 2) AS cumulative_sales
FROM fact_sales f
LEFT JOIN dim_time t ON f.time_key = t.time_key
GROUP BY t.year, t.month, t.month_name
ORDER BY t.year, t.month;
"""

result = pd.read_sql(query, engine)
display(result)
print('\n‚úÖ Task 11.2 Complete')

================================================================================
üìä TASK 11.2: Monthly Sales with 3-Month Moving Average
================================================================================

,year,month,month_name,transactions,monthly_sales,moving_avg_3_months,cumulative_sales
0,2015,1,January,77,14205.71,14205.71,14205.71
1,2015,2,February,46,4519.92,9362.82,18725.63
2,2015,3,March,154,55205.83,24643.82,73931.46
3,2015,4,April,130,27906.86,29210.87,101838.32
4,2015,5,May,121,23644.30,35585.66,125482.62
5,2015,6,June,131,34322.94,28624.70,159805.56
6,2015,7,July,142,33781.52,30582.92,193587.08
7,2015,8,August,146,27117.53,31740.66,220704.61
8,2015,9,September,267,81623.52,47507.52,302328.13
9,2015,10,October,159,31453.37,46731.47,333781.50
10,2015,11,November,306,77907.69,63661.53,411689.19
11,2015,12,December,274,68167.08,59176.05,479856.27
12,2016,1,January,57,18066.96,54713.91,497923.23
13,2016,2,February,64,11951.40,32728.48,509874.63
14,2016,3,March,128,32339.32,20785.89,542213.95
15,2016,4,April,159,34154.51,26148.41,576368.46
16,2016,5,May,143,29959.56,32151.13,606328.02
17,2016,6,June,129,23599.39,29237.82,629927.41
18,2016,7,July,136,28608.25,27389.07,658535.66
19,2016,8,August,158,36818.33,29675.32,695353.99
20,2016,9,September,285,63133.56,42853.38,758487.55
21,2016,10,October,164,31011.71,43654.53,789499.26
22,2016,11,November,321,75249.35,56464.87,864748.61
23,2016,12,December,311,74543.60,60268.22,939292.21
24,2017,1,January,89,18542.52,56111.82,957834.73
25,2017,2,February,83,22978.82,38688.31,980813.55
26,2017,3,March,161,51165.04,30895.46,1031978.59
27,2017,4,April,168,38679.77,37607.88,1070658.36
28,2017,5,May,221,56656.93,48833.91,1127315.29
29,2017,6,June,196,39724.49,45020.40,1167039.78
30,2017,7,July,196,38320.81,44900.74,1205360.59
31,2017,8,August,175,30542.18,36195.83,1235902.77
32,2017,9,September,349,69193.44,46018.81,1305096.21
33,2017,10,October,192,59583.09,53106.24,1364679.30
34,2017,11,November,366,79066.56,69281.03,1443745.86
35,2017,12,December,338,95739.15,78129.60,1539485.01
36,2018,1,January,143,43476.47,72760.73,1582961.48
37,2018,2,February,104,19920.98,53045.53,1602882.46
38,2018,3,March,237,58863.41,40753.62,1661745.87
39,2018,4,April,200,35541.90,38108.76,1697287.77
40,2018,5,May,240,43825.95,46077.09,1741113.72
41,2018,6,June,235,48190.73,42519.53,1789304.45
42,2018,7,July,223,44825.12,45613.93,1834129.57
43,2018,8,August,214,62837.81,51951.22,1896967.38
44,2018,9,September,453,86152.90,64605.28,1983120.28
45,2018,10,October,294,77448.17,75479.63,2060568.45
46,2018,11,November,456,117938.14,93846.40,2178506.59
47,2018,12,December,459,83030.38,92805.56,2261536.97

‚úÖ Task 11.2 Complete

In [19]:
# %% Task 11.3: Category Sales with Running Total and Percentage
print('\n' + '=' * 80)
print('üìä TASK 11.3: Category Sales with Running Total and Contribution %')
print('=' * 80)

query = """
WITH category_sales AS (
    SELECT 
        p.category,
        ROUND(SUM(f.sales)::numeric, 2) AS total_sales
    FROM fact_sales f
    LEFT JOIN dim_product p ON f.product_key = p.product_key
    GROUP BY p.category
)
SELECT 
    category,
    total_sales,
    ROUND(SUM(total_sales) OVER (ORDER BY total_sales DESC)::numeric, 2) AS running_total,
    ROUND(
        100.0 * total_sales / SUM(total_sales) OVER (),
        2
    ) AS pct_of_total,
    ROUND(
        100.0 * SUM(total_sales) OVER (ORDER BY total_sales DESC) / SUM(total_sales) OVER (),
        2
    ) AS cumulative_pct
FROM category_sales
ORDER BY total_sales DESC;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° Shows which categories contribute most to total sales.')
print('‚úÖ Task 11.3 Complete')

================================================================================
üìä TASK 11.3: Category Sales with Running Total and Contribution %
================================================================================

          category  total_sales  running_total  pct_of_total  cumulative_pct
0       Technology    827455.94      827455.94         36.59           36.59
1        Furniture    728658.75     1556114.69         32.22           68.81
2  Office Supplies    705422.28     2261536.97         31.19          100.00

üí° Shows which categories contribute most to total sales.
‚úÖ Task 11.3 Complete

In [20]:
# %% Task 11.4: Customer Sales with LAG and LEAD
print('\n' + '=' * 80)
print('üìä TASK 11.4: Customer Sales with Previous/Next Month Comparison')
print('=' * 80)

query = """
WITH monthly_category_sales AS (
    SELECT 
        p.category,
        t.year,
        t.month,
        t.month_name,
        ROUND(SUM(f.sales)::numeric, 2) AS monthly_sales
    FROM fact_sales f
    LEFT JOIN dim_product p ON f.product_key = p.product_key
    LEFT JOIN dim_time t ON f.time_key = t.time_key
    GROUP BY p.category, t.year, t.month, t.month_name
)
SELECT 
    category,
    year,
    month_name,
    monthly_sales,
    LAG(monthly_sales) OVER (PARTITION BY category ORDER BY year, month) AS prev_month_sales,
    LEAD(monthly_sales) OVER (PARTITION BY category ORDER BY year, month) AS next_month_sales,
    ROUND(
        monthly_sales - LAG(monthly_sales) OVER (PARTITION BY category ORDER BY year, month),
        2
    ) AS mom_change
FROM monthly_category_sales
ORDER BY category, year, month
LIMIT 50;
"""

result = pd.read_sql(query, engine)
display(result)
print('\nüí° LAG gets previous row, LEAD gets next row.')
print('üí° mom_change = Month-over-Month change.')
print('‚úÖ Task 11.4 Complete')

================================================================================
üìä TASK 11.4: Customer Sales with Previous/Next Month Comparison
================================================================================

,category,year,month_name,monthly_sales,prev_month_sales,next_month_sales,mom_change
0,Furniture,2015,January,6217.28,NaN,1839.66,NaN
1,Furniture,2015,February,1839.66,6217.28,14243.39,-4377.62
2,Furniture,2015,March,14243.39,1839.66,7944.83,12403.73
3,Furniture,2015,April,7944.83,14243.39,6912.80,-6298.56
4,Furniture,2015,May,6912.80,7944.83,13144.58,-1032.03
5,Furniture,2015,June,13144.58,6912.80,10821.07,6231.78
6,Furniture,2015,July,10821.07,13144.58,7125.21,-2323.51
7,Furniture,2015,August,7125.21,10821.07,23816.48,-3695.86
8,Furniture,2015,September,23816.48,7125.21,12304.24,16691.27
9,Furniture,2015,October,12304.24,23816.48,21471.03,-11512.24
10,Furniture,2015,November,21471.03,12304.24,30637.35,9166.79
11,Furniture,2015,December,30637.35,21471.03,11739.93,9166.32
12,Furniture,2016,January,11739.93,30637.35,3134.37,-18897.42
13,Furniture,2016,February,3134.37,11739.93,8722.64,-8605.56
14,Furniture,2016,March,8722.64,3134.37,10475.71,5588.27
15,Furniture,2016,April,10475.71,8722.64,9374.97,1753.07
16,Furniture,2016,May,9374.97,10475.71,7540.97,-1100.74
17,Furniture,2016,June,7540.97,9374.97,13667.04,-1834.00
18,Furniture,2016,July,13667.04,7540.97,9638.59,6126.07
19,Furniture,2016,August,9638.59,13667.04,25085.43,-4028.45
20,Furniture,2016,September,25085.43,9638.59,11664.50,15446.84
21,Furniture,2016,October,11664.50,25085.43,30197.47,-13420.93
22,Furniture,2016,November,30197.47,11664.50,22812.26,18532.97
23,Furniture,2016,December,22812.26,30197.47,7622.76,-7385.21
24,Furniture,2017,January,7622.76,22812.26,3925.55,-15189.50
25,Furniture,2017,February,3925.55,7622.76,12272.67,-3697.21
26,Furniture,2017,March,12272.67,3925.55,13212.10,8347.12
27,Furniture,2017,April,13212.10,12272.67,14892.57,939.43
28,Furniture,2017,May,14892.57,13212.10,12450.54,1680.47
29,Furniture,2017,June,12450.54,14892.57,12569.77,-2442.03
30,Furniture,2017,July,12569.77,12450.54,11910.05,119.23
31,Furniture,2017,August,11910.05,12569.77,26755.50,-659.72
32,Furniture,2017,September,26755.50,11910.05,11813.03,14845.45
33,Furniture,2017,October,11813.03,26755.50,31783.63,-14942.47
34,Furniture,2017,November,31783.63,11813.03,36604.98,19970.60
35,Furniture,2017,December,36604.98,31783.63,5930.17,4821.35
36,Furniture,2018,January,5930.17,36604.98,6774.36,-30674.81
37,Furniture,2018,February,6774.36,5930.17,10893.44,844.19
38,Furniture,2018,March,10893.44,6774.36,9065.93,4119.08
39,Furniture,2018,April,9065.93,10893.44,16957.55,-1827.51
40,Furniture,2018,May,16957.55,9065.93,17032.41,7891.62
41,Furniture,2018,June,17032.41,16957.55,11375.83,74.86
42,Furniture,2018,July,11375.83,17032.41,15419.10,-5656.58
43,Furniture,2018,August,15419.10,11375.83,28516.72,4043.27
44,Furniture,2018,September,28516.72,15419.10,21884.11,13097.62
45,Furniture,2018,October,21884.11,28516.72,37056.73,-6632.61
46,Furniture,2018,November,37056.73,21884.11,31407.45,15172.62
47,Furniture,2018,December,31407.45,37056.73,NaN,-5649.28
48,Office Supplies,2015,January,4845.14,NaN,1071.75,NaN
49,Office Supplies,2015,February,1071.75,4845.14,8602.47,-3773.39

üí° LAG gets previous row, LEAD gets next row.
üí° mom_change = Month-over-Month change.
‚úÖ Task 11.4 Complete

## Summary

All OLAP queries completed successfully!

In [21]:
# %% Summary
print('=' * 80)
print('üéâ ALL TASKS COMPLETE')
print('=' * 80)

print('\n‚úÖ Task 5: Basic Aggregates (SUM, AVG, COUNT, MIN, MAX)')
print('‚úÖ Task 6: GROUP BY ROLLUP')
print('‚úÖ Task 7: GROUP BY CUBE')
print('‚úÖ Task 8: GROUPING SETS')
print('‚úÖ Task 9: RANK and DENSE_RANK')
print('‚úÖ Task 10: PIVOT Queries')
print('‚úÖ Task 11: Window Functions (Moving Averages, Cumulative Sums)')

print('\nüåü OLAP Analysis Complete!')

================================================================================
üéâ ALL TASKS COMPLETE
================================================================================

‚úÖ Task 5: Basic Aggregates (SUM, AVG, COUNT, MIN, MAX)
‚úÖ Task 6: GROUP BY ROLLUP
‚úÖ Task 7: GROUP BY CUBE
‚úÖ Task 8: GROUPING SETS
‚úÖ Task 9: RANK and DENSE_RANK
‚úÖ Task 10: PIVOT Queries
‚úÖ Task 11: Window Functions (Moving Averages, Cumulative Sums)

üåü OLAP Analysis Complete!